# DeepFM

- https://arxiv.org/pdf/1804.04950.pdf **
- https://arxiv.org/pdf/1703.04247.pdf
- https://arxiv.org/pdf/1606.07792.pdf
- https://youtu.be/MMTuoFFRCCs
- https://www.youtube.com/watch?v=1cRGpDXTJC8
- https://6chaoran.wordpress.com/2019/01/03/implement-deepfm-model-in-keras/

In [9]:
import os
import pandas as pd
import numpy as np
from keras.layers import Input, Embedding, Reshape, Flatten, Dense, Dropout, BatchNormalization

In [2]:
path = '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/bank_products_data/'

In [3]:
files = [f for r,d,f in os.walk(path)][0]
filepaths = [path+i for i in files[1:]]
filepaths

['/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/bank_products_data/train_sample2m.csv',
 '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/bank_products_data/train_ver2.csv',
 '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/bank_products_data/sample_submission.csv',
 '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/bank_products_data/test_ver2.csv']

In [4]:
train = pd.read_csv(filepaths[0])
test = pd.read_csv(filepaths[3])
samplesubmission = pd.read_csv(filepaths[2])

train.drop(['Unnamed: 0','index'], axis=1, inplace=True)

/Users/akshay/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (13,17) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
/Users/akshay/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (15) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [5]:
train.columns = ['partition',
                 'customer_code',
                 'employee_index',
                 'country',
                 'sex',
                 'age',
                 'contract_date',
                 'new_customer_index',
                 'seniority',
                 'primary_status',
                 'last_date_primary',
                 'customer_type_startmonth',
                 'relation_type',
                 'residence_index',
                 'foreign_index',
                 'spouse',
                 'join_channel',
                 'deceased_index',
                 'address_type',
                 'province_code',
                 'province_name',
                 'activity_index',
                 'gross_income',
                 'segment',
                 'savings_account',
                 'guarantees',
                 'current_account',
                 'derivada_account',
                 'payroll_account',
                 'junior_account',
                 'mas_particular_account',
                 'particular_account',
                 'particular_plus_account',
                 'short_term_deposits',
                 'medium_term_deposits',
                 'long_term_deposits',
                 'e_account',
                 'funds',
                 'mortgage',
                 'pensions',
                 'loans',
                 'taxes',
                 'credit_card',
                 'securities',
                 'home_account',
                 'payroll',
                 'pensions',
                 'direct_debit']

In [6]:
train.head()

,partition,customer_code,employee_index,country,sex,age,contract_date,new_customer_index,seniority,primary_status,...,mortgage,pensions,loans,taxes,credit_card,securities,home_account,payroll,pensions,direct_debit
0,2016-03-28,1190588,N,ES,H,22,2013-10-04,0.0,29,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
1,2016-03-28,1190589,N,ES,H,23,2013-10-04,0.0,29,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
2,2016-03-28,1190590,N,ES,V,22,2013-10-04,0.0,29,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
3,2016-03-28,1190591,N,ES,H,26,2013-10-04,0.0,29,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
4,2016-03-28,1190592,N,ES,H,29,2013-10-04,0.0,29,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0

In [14]:
product_fields = list(train.columns[-24:])

In [15]:
train1 = train[product_fields]

In [19]:
inputs = []
outputs = []

In [20]:
for p in product_fields:
    inp = Input(shape=(1,))
    out = Embedding(2,10,name=p)(inp)
    
    inputs.append(inp)
    outputs.append(out)
    
for i in range()

In [24]:
import pandas as pd
import numpy as np
import os

data_path = '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/IMDB/'
filenames = [f for r,d,f in os.walk(data_path)][0]
filepaths = [data_path+f for f in filenames if f[-4:]=='.csv']
filepaths

['/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/IMDB/IMDb movies.csv',
 '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/IMDB/IMDb names.csv',
 '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/IMDB/IMDb title_principals.csv',
 '/Users/akshay/Dropbox/Personal/Data Science/Codes/Projects Non Git/IMDB/IMDb ratings.csv']

In [27]:
movies = pd.read_csv(filepaths[0])
movies.head()

/Users/akshay/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0

In [28]:
names = pd.read_csv(filepaths[1])
names.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,date_of_birth,place_of_birth,death_details,date_of_death,place_of_death,reason_of_death,spouses_string,spouses,divorces,spouses_with_children,children
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,"Los Angeles, California, USA",pneumonia,Robyn Smith (27 June 1980 - 22 June 1987) (hi...,2,0,1,2
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,"New York City, New York, USA",stroke,Jason Robards (4 July 1961 - 10 September 196...,2,1,2,3
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934-09-28,"Paris, France",NaN,NaN,NaN,NaN,Bernard d'Ormale (16 August 1992 - present)\n...,4,3,1,1
3,nm0000004,John Belushi,John Adam Belushi,170.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,"Hollywood, Los Angeles, California, USA",acute cocaine and heroin intoxication,Judith Belushi-Pisano (31 December 1976 - 5 M...,1,0,0,0
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,"Fårö, Gotlands län, Sweden",natural causes,Ingrid Bergman (11 November 1971 - 20 May 199...,5,4,5,8

In [30]:
title = pd.read_csv(filepaths[2])
title.head()

,imdb_title_id,ordering,imdb_name_id,category,job,characters
0,tt0000009,1,nm0063086,actress,NaN,"[""Miss Geraldine Holbrook (Miss Jerry)""]"
1,tt0000009,2,nm0183823,actor,NaN,"[""Mr. Hamilton""]"
2,tt0000009,3,nm1309758,actor,NaN,"[""Chauncey Depew - the Director of the New Yor..."
3,tt0000009,4,nm0085156,director,NaN,NaN
4,tt0000574,1,nm0846887,actress,NaN,"[""Kate Kelly""]"

In [31]:
ratings = pd.read_csv(filepaths[3])
ratings

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,5.9,154,5.9,6.0,12,4,10,43,28,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,6.1,589,6.3,6.0,57,18,58,137,139,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,5.8,188,6.0,6.0,6,6,17,44,52,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0
3,tt0002101,5.2,446,5.3,5.0,15,8,16,62,98,...,5.5,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0
4,tt0002130,7.0,2237,6.9,7.0,210,225,436,641,344,...,7.3,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,5.3,398,5.5,6.0,13,9,26,65,104,...,5.7,11.0,5.0,2.0,5.5,12.0,6.3,22.0,5.3,214.0
85851,tt9911196,7.7,724,7.9,8.0,65,139,288,170,42,...,8.0,47.0,7.3,30.0,7.0,6.0,6.8,13.0,7.7,388.0
85852,tt9911774,7.9,265,7.8,8.0,63,29,61,61,31,...,NaN,NaN,NaN,NaN,1.0,1.0,NaN,NaN,2.0,2.0
85853,tt9914286,6.4,194,9.4,10.0,176,0,2,2,1,...,NaN,NaN,7.0,1.0,4.0,3.0,1.7,5.0,5.8,5.0
85854,tt9914942,6.7,102,6.8,7.0,4,4,21,35,27,...,6.8,4.0,7.5,4.0,7.0,4.0,6.7,13.0,6.7,60.0